org/blogs/discontinuous-galerkin-method-from-scratch-in-python-gmsh.org
#+SETUPFILE: ./blog-styles.org
#+TITLE: DG Method From Scratch (in Python) - Gmsh 
#+SUBTITLE: Making a mesh and extracting information
#+HTML: <p class="date"><i>last update: Feb 4, 2025</i></p>

* Article Motivation 
#+BEGIN_QUOTE
- How do you make a mesh on Gmsh?
- How do I loop over elements or faces?
- How do I get the normal to each face?
- How do I find the boundary nodes and faces?
- Create a python class called ~Mesh~ with functions that return important information about the Gmsh mesh.
#+END_QUOTE

* Introduction
Gmsh is an *open source* 3D finite element mesh generator [cite:@geuzaine2009gmsh]. Let's use it to produce triangle and tetrahedral meshes. Then, we'll extract all the information we need to do a finite element simulation (like vertices for each cell, normal to each face, boundary faces, which elements are touching and on which face).

* Creating a 2D and 3D mesh in Gmsh
Let's create some meshes that we can use as examples.

We'll start with a 2D mesh. We'll make a simple ellipse and we'll do it using Gmsh's built in geometry kernel. We'll save the following as ~2d-ellipse.geo~

#+BEGIN_SRC gmsh
cm = 1e-02; // centimeters
a = 6 * cm; // Semi-major axis
b = 4 * cm; // Semi-minor axis
Lc = 0.01;  // characteristic cell length 

// Define center and ellipse points
Point(1) = {0, 0, 0, Lc};
Point(2) = {a, 0, 0, Lc};
Point(3) = {0, b, 0, Lc};
Point(4) = {-a, 0, 0, Lc};
Point(5) = {0, -b, 0, Lc};

// Define ellipse using center and points
Ellipse(1) = {2, 1, 3};
Ellipse(2) = {3, 1, 4};
Ellipse(3) = {4, 1, 5};
Ellipse(4) = {5, 1, 2};

// Define surface
Curve Loop(5) = {1, 2, 3, 4};
Plane Surface(6) = {5};
#+END_SRC

We can then run the following code to produce a ~.msh~ file, Gmsh's own file type for storing mesh data.

#+BEGIN_SRC bash
gmsh -2 2d-ellipse.geo -o 2d-ellipse.msh
#+END_SRC

Now let's use the /OpenCASCADE/ geometry Kernel that is available using Gmsh's python API. We'll create the following file called ~3d-torus.py~

#+BEGIN_SRC python
import gmsh
import sys

# initialize gmsh
gmsh.initialize(sys.argv)

# Same parameters as 2D problem
cm = 1e-02;
a = 6 * cm;
b = 4 * cm;
Lc = 0.01;

# Create an ellipse using OpenCASCADE
ellipse = gmsh.model.occ.addTorus(0, 0, 0, a, b)

# Synchronize the model
gmsh.model.occ.synchronize();

# Generate a 2D mesh
gmsh.model.mesh.generate(2)

# Save the mesh as a .msh file
gmsh.write("3d-torus.msh")

# Run the GUI
gmsh.fltk.run()

gmsh.finalize()
#+END_SRC

Running this python file with ~python 3d-torus.py~ will produce our 3D ~.msh~ file.

