blogs/discontinuous-galerkin-method-from-scratch-in-python-gmsh.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-05 Wed 17:51 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>DG Method From Scratch (in Python) - Gmsh</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.7.2/css/all.min.css">
<link href="https://fonts.googleapis.com/css2?family=Roboto+Serif:ital,opsz,wght@0,8..144,100..900;1,8..144,100..900&display=swap" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/css/styles.css" />
<base target="_blank">
</head>
<body>
<div id="preamble" class="status">
<nav>
    <!-- Checkbox for toggling menu -->
    <input type="checkbox" id="check">
    <!-- Menu icon -->
    <label for="check" class="checkbtn">
      <i class="fas fa-bars"></i>
    </label>
    <!-- Site logo -->
    <label class="logo"><a href="/index.html">Go Van Go</a></label>
    <!-- Navigation links -->
    <ul class="navbar-ul">
      <li><a target="_self" class="active" href="/index.html">Home</a></li>
      <li><a target="_self" href="/about.html">About</a></li>
      <li><a target="_self" href="/blog.html">Blog</a></li>
      <li><a target="_self" href="/contact.html">Contact</a></li>
    </ul>
  </nav>
</div>
<div id="content" class="content">
<h1 class="title">DG Method From Scratch (in Python) - Gmsh
<br>
<span class="subtitle">Making a mesh and extracting information</span>
</h1>
<p class="date"><i>last update: Feb 4, 2025</i></p>
<div id="outline-container-org417023e" class="outline-2">
<h2 id="org417023e">Article Motivation</h2>
<div class="outline-text-2" id="text-org417023e">
<blockquote>
<ul class="org-ul">
<li>How do you make a mesh on Gmsh?<br></li>
<li>How do I loop over elements or faces?<br></li>
<li>How do I get the normal to each face?<br></li>
<li>How do I find the boundary nodes and faces?<br></li>
<li>Create a python class called <code>Mesh</code> with functions that return important information about the Gmsh mesh.<br></li>
</ul>
</blockquote>
</div>
</div>
<div id="outline-container-org4dcfe3d" class="outline-2">
<h2 id="org4dcfe3d">Introduction</h2>
<div class="outline-text-2" id="text-org4dcfe3d">
<p>
Gmsh is an <b>open source</b> 3D finite element mesh generator [<a href="#citeproc_bib_item_1">1</a>]. Let's use it to produce triangle and tetrahedral meshes. Then, we'll extract all the information we need to do a finite element simulation (like vertices for each cell, normal to each face, boundary faces, which elements are touching and on which face).<br>
</p>
</div>
</div>
<div id="outline-container-org6ade896" class="outline-2">
<h2 id="org6ade896">Creating a 2D and 3D mesh in Gmsh</h2>
<div class="outline-text-2" id="text-org6ade896">
<p>
Let's create some meshes that we can use as examples.<br>
</p>

<p>
We'll start with a 2D mesh. We'll make a simple ellipse and we'll do it using Gmsh's built in geometry kernel. We'll save the following as <code>2d-ellipse.geo</code><br>
</p>

<div class="org-src-container">
<pre class="src src-gmsh"><span style="color: #D8DEE9;">cm</span> = 1e-02; <span style="color: #6f7787;">// </span><span style="color: #6f7787;">centimeters</span>
<span style="color: #D8DEE9;">a</span> = 6 * cm; <span style="color: #6f7787;">// </span><span style="color: #6f7787;">Semi-major axis</span>
<span style="color: #D8DEE9;">b</span> = 4 * cm; <span style="color: #6f7787;">// </span><span style="color: #6f7787;">Semi-minor axis</span>
<span style="color: #D8DEE9;">Lc</span> = 0.01;  <span style="color: #6f7787;">// </span><span style="color: #6f7787;">characteristic cell length </span>

<span style="color: #6f7787;">// </span><span style="color: #6f7787;">Define center and ellipse points</span>
<span style="color: #81A1C1;">Point</span>(1) = {0, 0, 0, Lc};
<span style="color: #81A1C1;">Point</span>(2) = {a, 0, 0, Lc};
<span style="color: #81A1C1;">Point</span>(3) = {0, b, 0, Lc};
<span style="color: #81A1C1;">Point</span>(4) = {-a, 0, 0, Lc};
<span style="color: #81A1C1;">Point</span>(5) = {0, -b, 0, Lc};

<span style="color: #6f7787;">// </span><span style="color: #6f7787;">Define ellipse using center and points</span>
<span style="color: #81A1C1;">Ellipse</span>(1) = {2, 1, 3};
<span style="color: #81A1C1;">Ellipse</span>(2) = {3, 1, 4};
<span style="color: #81A1C1;">Ellipse</span>(3) = {4, 1, 5};
<span style="color: #81A1C1;">Ellipse</span>(4) = {5, 1, 2};

<span style="color: #6f7787;">// </span><span style="color: #6f7787;">Define surface</span>
<span style="color: #81A1C1;">Curve Loop</span>(5) = {1, 2, 3, 4};
<span style="color: #81A1C1;">Plane Surface</span>(6) = {5};
</pre>
</div>

<p>
We can then run the following code to produce a <code>.msh</code> file, Gmsh's own file type for storing mesh data.<br>
</p>

<div class="org-src-container">
<pre class="src src-bash">gmsh -2 2d-ellipse.geo -o 2d-ellipse.msh
</pre>
</div>

<p>
Now let's use the <i>OpenCASCADE</i> geometry Kernel that is available using Gmsh's python API. We'll create the following file called <code>3d-torus.py</code><br>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #81A1C1;">import</span> gmsh
<span style="color: #81A1C1;">import</span> sys

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">initialize gmsh</span>
gmsh.initialize(sys.argv)

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Same parameters as 2D problem</span>
<span style="color: #D8DEE9;">cm</span> = 1e-02;
<span style="color: #D8DEE9;">a</span> = 6 * cm;
<span style="color: #D8DEE9;">b</span> = 4 * cm;
<span style="color: #D8DEE9;">Lc</span> = 0.01;

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Create an ellipse using OpenCASCADE</span>
<span style="color: #D8DEE9;">ellipse</span> = gmsh.model.occ.addTorus(0, 0, 0, a, b)

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Synchronize the model</span>
gmsh.model.occ.synchronize();

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Generate a 2D mesh</span>
gmsh.model.mesh.generate(2)

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Save the mesh as a .msh file</span>
gmsh.write(<span style="color: #A3BE8C;">"3d-torus.msh"</span>)

<span style="color: #6f7787;"># </span><span style="color: #6f7787;">Run the GUI</span>
gmsh.fltk.run()

gmsh.finalize()
</pre>
</div>

<p>
Running this python file with <code>python 3d-torus.py</code> will produce our 3D <code>.msh</code> file.<br>
</p>
</div>
</div>
